app/controllers/maps_controller.rb

SELECT  "maps".* FROM "maps" WHERE "maps"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def show
	@map = Map.find(params[:id])

SELECT "maps".* FROM "maps"
---
  def index
  	@maps = Map.all

SELECT  "maps".* FROM "maps" WHERE "maps"."id" = ? LIMIT ?  [["id", 9], ["LIMIT", 1]]
---
  def edit
  	@map = Map.find(params[:id])

INSERT INTO "maps" ("maptitle", "datapoints", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["maptitle", "Leadership Group"], ["datapoints", 32], ["created_at", "2017-08-25 08:03:28.190101"], ["updated_at", "2017-08-25 08:03:28.190101"]]
---
	def create
	  @map = Map.new(map_params)

	  if @map.save

SELECT  "maps".* FROM "maps" WHERE "maps"."id" = ? LIMIT ?  [["id", 11], ["LIMIT", 1]]
---
	def vsd
		@map = Map.find(params[:id])

SELECT "maps".* FROM "maps"
---
	def moremaps
		@map = Map.all

SELECT  "maps".* FROM "maps" WHERE "maps"."id" = ? LIMIT ?  [["id", nil], ["LIMIT", 1]]
UPDATE "maps" SET "sourcefile" = ?, "updated_at" = ? WHERE "maps"."id" = ?  [["sourcefile", "#<ActionDispatch::Http::UploadedFile:0x00000007abf2f0>"], ["updated_at", "2017-09-04 14:19:04.559199"], ["id", 12]]
---
	def import
		uploaded_io = params[:sourcefile]

		uploaded_file_name = Time.now.strftime("%d%m%y%H%M%S").to_s + uploaded_io.original_filename.to_s

		File.open(Rails.root.join('public', 'uploads', uploaded_file_name), 'wb') do |file|
		  file.write(uploaded_io.read)
		end

		@map = Map.find(params[:id])
		if @map.update(sourcefile: uploaded_file_name)