app/controllers/users_controller.rb

  def index
    $selectedmap = nil
    @users = User.all
---
SELECT "users".* FROM "users"

  def show
    $selectedmap = nil
    @user = User.find(params[:id])
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? ORDER BY "users"."id" ASC LIMIT ?  [["id", 1], ["LIMIT", 1]]

  def update
    @user = User.find(params[:id])
    if @user.update_attributes(secure_params)
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? ORDER BY "users"."id" ASC LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "users" SET "phone" = ?, "caa" = ?, "cua" = ?, "pm" = ?, "etp" = ?, "vsd" = ?, "eci" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["phone", "user@example.com"], ["caa", "f"], ["cua", "t"], ["pm", "f"], ["etp", "f"], ["vsd", "t"], ["eci", "f"], ["updated_at", "2017-09-04 08:21:46.048496"], ["id", 4]]

  def edit
    $selectedmap = nil
     @user = User.find(params[:id])
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? ORDER BY "users"."id" ASC LIMIT ?  [["id", 1], ["LIMIT", 1]]